tap "hashicorp/tap"


#   -----------------------------
#   Basic App
#   -----------------------------
cask "google-chrome"
cask "google-drive"
cask "spotify"
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353


#   -----------------------------
#   Documentation App
#   -----------------------------
cask "notion"


#   -----------------------------
#   Video Conferencing App
#   -----------------------------
cask "webex"
cask "zoom"


#   -----------------------------
#   Messaging App
#   -----------------------------
cask "signal"
cask "slack"
cask "telegram"
cask "wechat"
cask "whatsapp"


#   -----------------------------
#   Password Manager App
#   -----------------------------
cask "1Password"

#   -----------------------------
#   Accessory App
#   -----------------------------
cask "logitech-options"
cask "via"
cask "rectangle"

#   -----------------------------
#   VPN App
#   -----------------------------
cask "v2rayx"


#   -----------------------------
#   Development Tool
#   -----------------------------

# terminal
brew "node"
brew "openssl@1.1"
brew "tree"
brew "tmux"
brew "wget"

# python
brew "cmake"
brew "libomp"
brew "pyenv"
brew "zlib"
cask "anaconda"

# cloud
brew "awscli"
cask "google-cloud-sdk"

# editor
cask "sublime-text"
cask "visual-studio-code"

# docker
brew "docker"
brew "docker-compose"

# git
brew "gh"
brew "git"
brew "git-lfs"
brew "gitmoji"
brew "pre-commit"

# terraform
brew "hashicorp/tap/terraform"

# Kubernetes
brew "kubernetes-cli"
brew "kubectx"
brew "helm"
brew "minikube"

# data analytics
cask "tableau"
cask "dbeaver-community"
