tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"


#   -----------------------------
#   Basic App
#   -----------------------------
cask "google-chrome"
cask "google-drive"
cask "nordvpn"
cask "spotify"
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353


#   -----------------------------
#   Documentation App
#   -----------------------------
cask "notion"
cask "quip"
mas "Agenda", id: 1287445660


#   -----------------------------
#   Video Conferencing App
#   -----------------------------
cask "webex"
cask "zoom"


#   -----------------------------
#   Messaging App
#   -----------------------------
cask "signal"
cask "slack"
cask "telegram"
cask "wechat"
cask "whatsapp"


#   -----------------------------
#   Password Manager App
#   -----------------------------
cask "1Password"


#   -----------------------------
#   Development Tool
#   -----------------------------

# common
brew "tree"
brew "tmux"
brew "wget"
brew "node"

# data analytics
cask "anaconda"
cask "tableau"
cask "dbeaver-community"

# cloud
brew "awscli"
cask "google-cloud-sdk"

# editor
cask "sublime-text"
cask "visual-studio-code"

# docker
brew "docker"
brew "docker-compose"

# git
brew "gh"
brew "git"
brew "git-lfs"
brew "pre-commit"

# Kubernetes
brew "kubernetes-cli"
brew "kubectx"
brew "helm"
brew "minikube"